{
  "index": {
    "hello": "helo"
  },
  "about": {
    "heading": "Helo, fi yw Ceri Morse, datblygwr stac llawn",
    "subheading": "Rwy'n dylunio ac yn datblygu datrysiadau meddalwedd i bawb",
    "bitesize": {
      "line1": "Wedi'i eni a'i fagu yng Nghymru, gwlad y dreigiau",
      "line2": "Rhugl yn y Gymraeg a'r Saesneg",
      "line3": "Wedi'i graddio o Brifysgol Caerdydd gyda gradd Baglor yn y Gwyddorau mewn Mathemateg a'i Chymwysiadau yn 2013",
      "line4": "Wedi'i drawsnewid o ddatblygu cymwysiadau annibynnol i ddatblygiad gwe stac llawn"
    },
    "history": {
      "paragraph1": "Dechreuodd fy niddordeb mewn creu datrysiadau meddalwedd yr holl ffordd yn ôl yn yr ysgol uwchradd. Adeiladais cymwysiad ar gyfer system siop gan ddefnyddio Microsoft Access fel rhan o brosiect. Roedd gweld y rhyngwyneb a'r profiad yn newid trwy addasu ychydig linellau o god yn hynod ddiddorol i mi. Es i ymlaen i astudio Mathemateg yn y brifysgol ond cymerais gymaint o fodiwlau Cyfrifiadureg â phosib. Adeiladais fy cymwys Java cyntaf, gêm hangman, a defnyddio C++ i ddysgu am brosesu cyfochrog a phrosesu delweddau. Cefais brosiect cyffrous yn fy mlwyddyn olaf yn gweithio gydag Undeb Rygbi Cymru yn modelu strategaethau y lein gan ddefnyddio theori gêm, efelychiad Monte Carlo a Python.",
      "paragraph2": "Yn ffres o'r brifysgol, dechreuais fy ngyrfa fel datblygwr C++ mewn cwmni gemau gamblo yn creu gemau casino rhithwir. Fe wnes i greu gêm roulette a welodd gynnydd o 700% mewn cyfanswm gwerth o'i gymharu â gêmau gyfartalog. Symudais i swydd arweiniol mewn tîm datblygu ar-lein newydd o fewn y cwmni a dyna lle dechreuodd fy niddordeb mewn datblygu ar gyfer y we. Po fwyaf y gwnes i archwilio'r ecosystem gyfoethog o dechnolegau gwe, y mwyaf y sylweddolais mai dyma'r llwybr i mi. Cynigiwyd rôl newydd i mi mewn cwmni ymgynghori ac fe wnes i arwain y gwaith o ddatblygu cynnyrch ymgysylltu rhithwir a oedd yn caniatáu i ymgynghoriadau cyhoeddus gorfodol barhau drwy’r pandemig COVID-19, gan arwain at wobr mewnol cynnyrch digidol y flwyddyn.",
      "timeline": {
        "description": "Mae mwy o wybodaeth ar gael ar fy llinell amser",
        "button": "Ymweld â'r llinell amser"
      }
    },
    "techstack": {
      "description": "Rwyf wedi defnyddio llawer o wahanol dechnolegau yn ystod fy amser fel datblygwr. Dyma beth rwy'n ei fwynhau fwyaf ac yn ei ddefnyddio o ddydd i ddydd.",
      "frontend": {
        "heading": "Penblaen",
        "description": "Rwy'n cymryd llawer o falchder mewn creu cymwysiadau hygyrch; mae'r we i bawb."
      },
      "backend": {
        "heading": "Pencefn",
        "description": "Rwy'n gwerthfawrogi dylunio glân a modiwlaidd gyda ffocws ar ailddefnyddio cod a darllenadwyedd."
      },
      "devops": {
        "heading": "DevOps",
        "description": "Rwy'n ceisio gwneud profiad y datblygwr ar gyfer lleoli cod mor ddi-dor â phosibl."
      }
    },
    "hobbies": {
      "description": "Nid yw bywyd i gyd yn ymwneud â gwaith. Dyma rai pethau rwy'n hoffi eu gwneud yn fy amser segur i gael hwyl ac ymlacio.",
      "adventuring": {
        "heading": "Anturio",
        "description": "Dwi wir yn mwynhau mynd ar anturiaethau! Gallai hyn fod yn unrhyw beth o heicio llwybrau lleol i deithio hanner ffordd o amgylch y byd i archwilio ardaloedd newydd."
      },
      "sport": {
        "heading": "Chwaraeon",
        "description": "With dyfu i fyny cymerais ran mewn nifer o wahanol chwaraeon unigol a thîm fel karate, golff a phêl-droed. Y dyddiau hyn dwi'n dringo ac yn chwarae amryw o chwaraeon raced fel modd o gadw'n heini."
      },
      "gaming": {
        "heading": "Gemau Fideo",
        "description": "Ers chwarae Duck Hunt ar fy nghonsol cyntaf, y NES, rydw i wedi mwynhau gemau fideo. Rwy'n chwarae gemau RPG yn bennaf, gyda The Elder Scrolls III: Morrowind yn ffefryn personol i mi. Team Fortress 2 ac Overwatch yw’r gemau FPS dwi'n dewis mwyaf amlaf."
      }
    }
  },
  "timeline": {
    "heading": "Hi, I'm Ceri Morse, a full stack developer",
    "subheading": "I design and develop software solutions for everyone",
    "events": {
      "arupSenior": "Dyrchafu i Uwch Ddatblygwr Meddalwedd yn Arup",
      "arupVirtualEngageAward": "",
      "arupStart": "Dechreuais rôl newydd yn Arup fel Datblygwr Meddalwedd",
      "astraOnline": "Arwain tîm sydd newydd ei greu yn Astra Games i ddatblygu cynnwys ar gyfer platfform ar-lein",
      "astraMid": "Dyrchafu i Beiriannydd Meddalwedd Lefel Ganol yn Astra Games",
      "astraStart": "Dechreuais fy ngyrfa waith yn Astra Games fel Peiriannydd Meddalwedd Iau",
      "uniGraduate": "Graddiais o Brifysgol Caerdydd gyda gradd 2:1",
      "uniReturn": "Dychwelais i Brifysgol Caerdydd i gwblhau blwyddyn olaf fy ngradd",
      "cassidianPlacement": "Treuliais fy mlwyddyn lleoliad diwydiannol yn Airbus Defence and Space yn datblygu gyda'r injan gêm Unity",
      "uniStart": "Dechreuais fy ngradd Baglor yn y Gwyddorau mewn Mathemateg a'i Chymwysiadau ym Mhrifysgol Caerdydd"
    }
  },
  "resume": {
    "heading": "Edrychwch are fy nghrynodeb proffesiynol",
    "subheading": "Fe welwch fy sgiliau perthnasol, profiad gwaith a mwy",
    "description": {
      "heading": "Crynodeb",
      "paragraph": {
        "line1": "Roeddwn i eisiau rhywle hygyrch i gadw fy nghrynodeb generig a pha le gwell nag ar fy ngwefan fy hun! Ar gyfer rhai ceisiadau efallai y byddaf yn ei deilwra i weddu i'r rôl ond mae llawer o'r wybodaeth graidd yn aros yr un fath.",
        "line2": "Put something here"
      },
      "update": "Diweddarwyd",
      "info": "Rwyf am bwysleisio mai fformat 2 dudalen yn unig yw hwn. Fe’i bwriedir fel trosolwg ac i annog trafodaethau."
    },
    "formats": {
      "heading": "Fformatau Arall",
      "paragraph": "You can download my cv here",
      "word": {
        "title": "Microsoft Word",
        "description": ""
      },
      "pdf": {
        "title": "PDF",
        "description": ""
      }
    }
  },
  "contact": {
    "heading": "Croeso i chi anfon neges ataf",
    "subheading": "Weithiau yr hen ffyrdd yw'r ffyrdd gorau",
    "description": {
      "heading": "Ebostiwch fi",
      "paragraph": "Os hoffech chi sgwrsio am prosiect, gyfle gwaith posib, neu unrhyw beth yn gyffredinol, llenwch y ffurflen isod a gwnaf fy ngorau i ymateb o fewn 1-2 ddiwrnod."
    },
    "form": {
      "nameLabel": "Enw",
      "nameRequired": "Mae angen enw",
      "emailLabel": "Ebost",
      "emailValid": "Nodwch ebost dilys",
      "emailRequired": "Mae angen ebost",
      "subjectLabel": "Pwnc",
      "subjectRequired": "Mae angen pwnc",
      "messageLabel": "Neges",
      "messageRequired": "Mae angen neges",
      "reset": "Ail Gychwyn",
      "send": "Anfon neges",
      "success": "Yay, mae eich neges wedi'i hanfon!"
    },
    "snackbar": {
      "success": "Neges wedi'i hanfon!",
      "error": "Neges wedi'i methu. Ceisiwch eto mewn 5 eiliad."
    }
  },
  "appbar": {
    "navigation": {
      "heading": "Llywio",
      "pages": {
        "home": "Cartref",
        "about": "About",
        "timeline": "Llinell Amser",
        "snippets": "Pytiau",
        "contact": "Cyswllt"
      }
    },
    "settings": {
      "heading": "Gosodiadau",
      "language": "Iaith",
      "theme": {
        "heading": "Thema",
        "light": "Golau",
        "dark": "Tywyll"
      }
    }
  },
  "footer": {
    "tagline": "Dylunio a datblygu datrysiadau meddalwedd stac llawn sy'n ymatebol ac yn hygyrch.",
    "notPlaying": "Ddim yn Chwarae",
    "sitemap": {
      "heading": "Map o'r wefan",
      "pages": {
        "home": "Cartref",
        "about": "About",
        "timeline": "Llinell Amser",
        "snippets": "Pytiau",
        "contact": "Cyswllt"
      }
    },
    "art": "Celf",
    "copyright": "© {year} Ceri Morse. Cedwir Pob Hawl."
  }
}
